{
    "section_about_me_title": "About Me",
    "section_about_me_content": "<p>My journey with technology began early, but it was during my Computer Networks graduation that a programming class, with its basic codes for network communication, demystified software development for me. What once seemed an insurmountable challenge, revealed itself as a fascinating and accessible field. This discovery solidified my passion for software engineering, solution architecture, and the development of robust APIs.</p><p>I am an enthusiast of continuous learning, keeping myself updated through programming-focused courses and pursuing certifications, such as those from AWS. I firmly believe that simplicity leads to robustness in code, and I see artificial intelligence as the key to the next phase of technological evolution.</p>",
    "section_work_experience_title": "Work Experience",
    "work_experience_quod_desc": "<ul><li>Starting a new and promising professional chapter as a Software Engineering Specialist, with great enthusiasm to contribute innovative solutions.</li><li>Currently, I am immersed in an excellent onboarding process, which has provided a smooth integration and a deeper understanding of the company's technologies and methodologies.</li></ul>",
    "work_experience_picpay_desc": "<ul><li>As a Senior Software Engineer, I led the development and improvement of backend solutions for commercial customer service (individual clients), using Java and Spring Boot.</li><li>My work encompassed the conception and implementation of microservices architectures and event-driven systems (Apache Kafka), focusing on scalability and resilience.</li><li>I have extensive experience with relational (MySQL, PostgreSQL) and non-relational (MongoDB) databases, as well as deep knowledge of software architecture patterns such as Layered, Hexagonal, and Clean Architecture.</li><li>I was responsible for the implementation and management of AWS infrastructure (EKS, EC2, IAM, S3, RDS, DMS) and the management of Kubernetes clusters with automated deployments via ArgoCD, applying robust CI/CD practices.</li></ul>",
    "work_experience_banco_original_desc": "<ul><li>For over 8 years as a Full Stack Software Engineer, I worked across the complete digital product development cycle.</li><li>My responsibilities included Mobile Banking development (Java for Android, Swift for iOS, and Ionic for hybrid interfaces) and Internet Banking (Angular).</li><li>On the backend, I worked with IBM Worklight and Rhino-JS.</li><li>Additionally, I was responsible for creating static solutions for the institutional website, always focusing on performance optimization and accessibility, contributing to the digital experience of millions of users.</li></ul>",
    "resume_role_title": "Senior Backend Developer",
    "section_tech_stack_title": "Tech Stack",
    "section_soft_skills_title": "Soft Skills",
    "soft_skill_proactivity": "Proactivity",
    "soft_skill_communication": "Communication",
    "soft_skill_self_management": "Self-Management",
    "soft_skill_organization": "Organization",
    "section_projects_title": "Projects",
    "project_be_the_hero_desc": "Project developed with Node.js, Express, Knex, and SQLite3. Responsible for managing NGO registration, cases, and connections with donors.",
    "project_algafood_api_desc": "API developed during studies with the AlgaFood course from AlgaWorks. Java project with Spring Boot, focused on good backend development practices, domain modeling, validations, exception handling, and use of JPA/Hibernate for data persistence.",
    "section_education_title": "Education",
    "education_analysis_development_systems": "Analysis and Systems Development",
    "education_computer_networks": "Computer Networks",
    "section_languages_title": "Languages",
    "language_portuguese": "Portuguese",
    "language_spanish": "Spanish",
    "language_english": "English",
    "footer_credits": "Designed with <span class=\"sr-only\">love</span><i class=\"bi bi-heart-fill\" style=\"color:#fe655c\"></i> by <a class=\"theme-link\" href=\"https://www.xiaoyingriley.com\" target=\"_blank\">Xiaoying Riley</a> and <a class=\"theme-link\" href=\"https://gemini.google.com/\" target=\"_blank\">Gemini</a> for developers"
}