{
    "section_about_me_title": "Sobre mí",
    "section_about_me_p1": "Mi viaje con la tecnología comenzó temprano, pero fue durante la carrera de Redes de Computadoras que una clase de programación, con sus códigos básicos para la comunicación entre redes, desmitificó el desarrollo de software para mí. Lo que antes parecía un desafío insuperable, se reveló como un campo fascinante y accesible. Este descubrimiento consolidó mi pasión por la ingeniería de software, la arquitectura de soluciones y el desarrollo de APIs robustas.",
    "section_about_me_p2": "Soy un entusiasta del aprendizaje continuo, manteniéndome actualizado a través de cursos enfocados en programación y buscando certificaciones, como las de AWS. Creo firmemente que la simplicidad conduce a la robustez en el código, y veo la inteligencia artificial como la clave para la próxima fase de la evolución tecnológica.",
    "section_work_experience_title": "Experiencia Laboral",
    "work_experience_quod_desc": "Iniciando un nuevo y prometedor capítulo profesional como Especialista en Ingeniería de Software, con gran entusiasmo por contribuir con soluciones innovadoras. Actualmente, estoy inmerso en un excelente proceso de incorporación, que ha proporcionado una integración fluida y una comprensión más profunda de las tecnologías y metodologías de la empresa.",
    "work_experience_picpay_desc": "Como Ingeniero de Software Senior, lideré el desarrollo y la mejora de soluciones backend para la atención comercial de clientes individuales, utilizando Java y Spring Boot. Mi trabajo abarcó la concepción e implementación de arquitecturas de microservicios y sistemas basados en eventos (Apache Kafka), centrándome en la escalabilidad y la resiliencia. Tengo una amplia experiencia con bases de datos relacionales (MySQL, PostgreSQL) y no relacionales (MongoDB), además de un profundo conocimiento en patrones de arquitectura de software como Layered, Hexagonal y Clean Architecture. Fui responsable de la implementación y gestión de la infraestructura de AWS (EKS, EC2, IAM, S3, RDS, DMS) y de la gestión de clústeres de Kubernetes con despliegues automatizados a través de ArgoCD, aplicando prácticas sólidas de CI/CD.",
    "work_experience_banco_original_desc": "Durante más de 8 años como Ingeniero de Software Full Stack, trabajé en el ciclo completo de desarrollo de productos digitales. Mis responsabilidades incluyeron el desarrollo de Mobile Banking (Java para Android, Swift para iOS e Ionic para interfaces híbridas) e Internet Banking (Angular). En el backend, trabajé con IBM Worklight y Rhino-JS. Además, fui responsable de la creación de soluciones estáticas para el sitio institucional, siempre centrándome en la optimización del rendimiento y la accesibilidad, contribuyendo a la experiencia digital de millones de usuarios.",
    "section_tech_stack_title": "Pila Tecnológica",
    "section_soft_skills_title": "Habilidades Blandas",
    "soft_skill_proactivity": "Proactividad",
    "soft_skill_communication": "Comunicación",
    "soft_skill_self_management": "Autogestión",
    "soft_skill_organization": "Organización",
    "section_projects_title": "Proyectos",
    "project_be_the_hero_desc": "Proyecto desarrollado con Node.js, Express, Knex y SQLite3. Responsable de gestionar el registro de ONGs, casos y conexiones con donantes.",
    "project_algafood_api_desc": "API desarrollada durante los estudios con el curso AlgaFood de AlgaWorks. Proyecto en Java con Spring Boot, enfocado en buenas prácticas de desarrollo backend, modelado de dominio, validaciones, manejo de excepciones y uso de JPA/Hibernate para la persistencia de datos.",
    "section_education_title": "Educación",
    "education_analysis_development_systems": "Análisis y Desarrollo de Sistemas",
    "education_computer_networks": "Redes de Computadoras",
    "section_languages_title": "Idiomas",
    "language_portuguese": "Portugués",
    "language_spanish": "Español",
    "language_english": "Inglés",
    "footer_credits": "Diseñado con <span class=\"sr-only\">amor</span><i class=\"bi bi-heart-fill\" style=\"color:#fe655c\"></i> por <a class=\"theme-link\" href=\"https://www.xiaoyingriley.com\" target=\"_blank\">Xiaoying Riley</a> y <a class=\"theme-link\" href=\"https://gemini.google.com/\" target=\"_blank\">Gemini</a> para desarrolladores"
}