{
    "section_about_me_title": "About me",
    "section_about_me_p1": "Minha jornada com a tecnologia começou cedo, mas foi durante a graduação em Redes de Computadores que uma aula de programação, com seus códigos básicos para comunicação entre redes, desmistificou o desenvolvimento de software para mim. O que antes parecia um desafio intransponível, revelou-se um campo fascinante e acessível. Essa descoberta consolidou minha paixão por engenharia de software, arquitetura de soluções e o desenvolvimento de APIs robustas.",
    "section_about_me_p2": "Sou um entusiasta do aprendizado contínuo, mantendo-me atualizado através de cursos focados em programação e buscando certificações, como as da AWS. Acredito firmemente que a simplicidade leva à robustez no código, e vejo a inteligência artificial como a chave para a próxima fase da evolução tecnológica.",
    "section_work_experience_title": "Work Experience",
    "work_experience_quod_desc": "Iniciando um novo e promissor capítulo profissional como Software Engineering Specialist, com grande entusiasmo para contribuir com soluções inovadoras. Atualmente, estou imerso em um processo de onboarding de excelência, que tem proporcionado uma integração fluida e o aprofundamento nas tecnologias e metodologias da empresa.",
    "work_experience_picpay_desc": "Como Engenheiro de Software Sênior, liderei o desenvolvimento e aprimoramento de soluções backend para o atendimento comercial de clientes PF, utilizando Java e Spring Boot. Minha atuação abrangeu a concepção e implementação de arquiteturas de microserviços e sistemas event-driven (Apache Kafka), com foco em escalabilidade e resiliência. Possuo vasta experiência com bancos de dados relacionais (MySQL, PostgreSQL) e não-relacionais (MongoDB), além de profundo conhecimento em padrões de arquitetura de software como Layered, Hexagonal e Clean Architecture. Fui responsável pela implantação e gestão de infraestrutura na AWS (EKS, EC2, IAM, S3, RDS, DMS) e pelo gerenciamento de clusters Kubernetes com deploys automatizados via ArgoCD, aplicando práticas robustas de CI/CD.",
    "work_experience_banco_original_desc": "Durante mais de 8 anos como Engenheiro de Software Full Stack, atuei no ciclo completo de desenvolvimento de produtos digitais. Minhas responsabilidades incluíram o desenvolvimento de Mobile Banking (Java para Android, Swift para iOS e Ionic para interfaces híbridas) e Internet Banking (Angular). No backend, trabalhei com IBM Worklight e Rhino-JS. Além disso, fui responsável pela criação de soluções estáticas para o site institucional, sempre com foco em otimização de performance e acessibilidade, contribuindo para a experiência digital de milhões de usuários.",
    "section_tech_stack_title": "Tech Stack",
    "section_soft_skills_title": "Soft Skills",
    "soft_skill_proactivity": "Proatividade",
    "soft_skill_communication": "Comunicação",
    "soft_skill_self_management": "Autogerenciamento",
    "soft_skill_organization": "Organização",
    "section_projects_title": "Projects",
    "project_be_the_hero_desc": "Projeto desenvolvido com Node.js, Express, Knex e SQLite3. Responsável por gerenciar o cadastro de ONGs, casos e conexões com doadores.",
    "project_algafood_api_desc": "API desenvolvida durante os estudos com o curso AlgaFood da AlgaWorks. Projeto em Java com Spring Boot, focado em boas práticas de desenvolvimento backend, modelagem de domínio, validações, tratamento de exceções, e uso de JPA/Hibernate para persistência de dados.",
    "section_education_title": "Education",
    "education_analysis_development_systems": "Análise e Desenvolvimento de Sistemas",
    "education_computer_networks": "Redes de Computadores",
    "section_languages_title": "Languages",
    "language_portuguese": "Portuguese",
    "language_spanish": "Spanish",
    "language_english": "English",
    "footer_credits": "Designed with <span class=\"sr-only\">love</span><i class=\"bi bi-heart-fill\" style=\"color:#fe655c\"></i> by <a class=\"theme-link\" href=\"https://www.xiaoyingriley.com\" target=\"_blank\">Xiaoying Riley</a> and <a class=\"theme-link\" href=\"https://gemini.google.com/\" target=\"_blank\">Gemini</a> for developers"
}